const data = {
    "cardio": [
        {
            "name": "Беговая дорожка",
            "img": "img/equipment/kardio/Беговая дорожка.jpg",
            "description": "Для эффективных кардиотренировок и сжигания калорий",
            "details": "Беговые дорожки идеально подходят для кардиотренировок любой интенсивности, от ходьбы до бега. <br> <b>Технические параметры:</b> Максимальная скорость: 20 км/ч, Угол наклона: 15%, Мощность двигателя: 3 л.с. <br> <b>Преимущества:</b>  Удобство использования, широкий выбор программ тренировок, возможность контроля за результатами, возможность регулировать скорость и угол наклона. <br> <b>Рекомендации:</b>  Перед началом тренировки проконсультируйтесь с врачом, чтобы определить оптимальную нагрузку. "
        },
        {
            "name": "Эллиптический тренажер",
            "img": "img/equipment/kardio/Эллиптический тренажер.jpg",
            "description": "Для кардиотренировок с минимальной нагрузкой на суставы",
            "details": "Эллиптические тренажеры обеспечивают плавное и естественное движение, снижая нагрузку на суставы. <br> <b>Технические параметры:</b> Длина шага: 51 см, Уровни сопротивления: 20, Максимальный вес пользователя: 150 кг. <br> <b>Преимущества:</b>  Низкая нагрузка на суставы, комплексная тренировка всего тела, возможность регулировать уровень сложности тренировки. <br> <b>Рекомендации:</b>  Следите за правильной техникой выполнения упражнений, чтобы избежать травм. "
        },
        {
            "name": "Велотренажер",
            "img": "img/equipment/kardio/Велотренажер.jpg",
            "description": "Для имитации езды на велосипеде и кардиотренировок",
            "details": "Велотренажеры позволяют проводить эффективные кардиотренировки в комфортных домашних условиях. <br> <b>Технические параметры:</b> Тип: вертикальный, Система нагрузки: магнитная, Количество программ: 12. <br> <b>Преимущества:</b>  Доступность,  компактность,  регулировка нагрузки,  имитация езды на велосипеде. <br> <b>Рекомендации:</b>  Правильно подберите размер и высоту седла, следите за правильной техникой педалирования. "
        },
        {
            "name": "Степпер",
            "img": "img/equipment/kardio/Степпер.jpg",
            "description": "Для имитации подъема по лестнице и тренировки мышц ног и ягодиц",
            "details": "Степперы - компактные и эффективные тренажеры для тренировки нижней части тела. <br> <b>Технические параметры:</b> Тип: мини-степпер,  Максимальный вес пользователя: 100 кг. <br> <b>Преимущества:</b>  Доступность,  компактность,  высокая эффективность для тренировки мышц ног и ягодиц,  возможность регулировки нагрузки. <br> <b>Рекомендации:</b>  Следите за правильной техникой выполнения упражнений,  увеличивайте нагрузку постепенно. "
        },
        {
            "name": "Гребной тренажер",
            "img": "img/equipment/kardio/Гребной тренажер.jpg",
            "description": "Для комплексной тренировки всего тела, имитирующей греблю",
            "details": "Гребные тренажеры задействуют множество групп мышц, обеспечивая полноценную тренировку. <br> <b>Технические параметры:</b> Система нагрузки: воздушная,  Уровни сопротивления: 10,  Максимальный вес пользователя: 130 кг. <br> <b>Преимущества:</b>  Комплексная тренировка всего тела,  минимальная нагрузка на суставы,  эффективность для тренировки сердечно-сосудистой системы,  возможность регулировать уровень сложности тренировки. <br> <b>Рекомендации:</b>  Следите за правильной техникой выполнения упражнений,  увеличивайте нагрузку постепенно. "
        },
        {
            "name": "Тредмилл",
            "img": "img/equipment/kardio/Тредмилл.jpg",
            "description": "Для высокоинтенсивных тренировок с использованием наклона",
            "details": "Тредмиллы - это продвинутые беговые дорожки с дополнительными функциями. <br> <b>Технические параметры:</b>  Максимальная скорость: 25 км/ч,  Угол наклона: 20%,  Мощность двигателя: 4 л.с. <br> <b>Преимущества:</b>  Широкий выбор программ тренировок,  возможность контроля за результатами,  возможность регулировать скорость и угол наклона. <br> <b>Рекомендации:</b>  Обязательно изучите инструкцию перед использованием,  постепенно увеличивайте нагрузку. "
        }
    ],
    "strength": [
        {
            "name": "Штанга",
            "img": "img/equipment/force/Штанга.jpg",
            "description": "Классический тренажер для силовых тренировок основных групп мышц",
            "details": "Штанги позволяют выполнять широкий спектр упражнений для развития силы и массы мышц. <br> <b>Технические параметры:</b> Тип: прямая,  Длина грифа: 220 см,  Максимальная нагрузка: 200 кг. <br> <b>Преимущества:</b>  Универсальность,  эффективность для развития силы и массы мышц,  возможность варьировать нагрузку. <br> <b>Рекомендации:</b>  Используйте штангу с осторожностью,  следите за правильной техникой выполнения упражнений,  постепенно увеличивайте нагрузку. "
        },
        {
            "name": "Гантели",
            "img": "img/equipment/force/Гантели.jpg",
            "description": "Универсальный тренажер для тренировки мышц рук, плеч и груди",
            "details": "Гантели подходят как для новичков, так и для опытных спортсменов, позволяя варьировать нагрузку. <br> <b>Технические параметры:</b> Тип: разборные,  Вес: 2-30 кг (набор). <br> <b>Преимущества:</b>  Доступность,  компактность,  возможность варьировать нагрузку,  эффективность для тренировки мышц рук, плеч и груди. <br> <b>Рекомендации:</b>  Используйте гантели с осторожностью,  следите за правильной техникой выполнения упражнений,  постепенно увеличивайте нагрузку. "
        },
        {
            "name": "Тренажер Смита",
            "img": "img/equipment/force/Тренажер Смита.jpg",
            "description": "Многофункциональный тренажер для безопасных силовых тренировок",
            "details": "Тренажер Смита обеспечивает фиксацию штанги, что делает тренировки более безопасными. <br> <b>Технические параметры:</b>  Максимальная нагрузка: 250 кг,  Угол наклона скамьи: регулируемый. <br> <b>Преимущества:</b>  Безопасность,  возможность выполнять широкий спектр упражнений,  регулировка нагрузки. <br> <b>Рекомендации:</b>  Следите за правильной техникой выполнения упражнений,  увеличивайте нагрузку постепенно. "
        },
        {
            "name": "Скамья для жима",
            "img": "img/equipment/force/Скамья для жима.jpg",
            "description": "Базовый тренажер для тренировки мышц груди, трицепсов и плеч",
            "details": "Скамья для жима - незаменимый элемент для комплексной тренировки верхней части тела. <br> <b>Технические параметры:</b>  Максимальная нагрузка: 150 кг,  Регулировка высоты: 3 уровня. <br> <b>Преимущества:</b>  Доступность,  эффективность для тренировки мышц груди, трицепсов и плеч,  возможность регулировать угол наклона. <br> <b>Рекомендации:</b>  Используйте скамью с осторожностью,  следите за правильной техникой выполнения упражнений. "
        },
        {
            "name": "Тяговый тренажер",
            "img": "img/equipment/force/Тяговый тренажер.jpg",
            "description": "Для тренировки мышц спины, бицепсов и предплечий",
            "details": "Тяговые тренажеры позволяют эффективно прорабатывать мышцы спины, развивая силу и выносливость. <br> <b>Технические параметры:</b>  Система нагрузки: блочная,  Максимальный вес стека: 80 кг. <br> <b>Преимущества:</b>  Безопасность,  эффективность для тренировки мышц спины, бицепсов и предплечий,  возможность регулировать нагрузку. <br> <b>Рекомендации:</b>  Следите за правильной техникой выполнения упражнений,  увеличивайте нагрузку постепенно. "
        },
        {
            "name": "Силовой тренажер для ног",
            "img": "img/equipment/force/Силовой тренажер для ног.jpg",
            "description": "Для изолированной тренировки мышц ног",
            "details": "Силовые тренажеры для ног позволяют выполнять различные упражнения,  изолированно прорабатывая мышцы ног. <br> <b>Технические параметры:</b>  Тип:  жимовой,  Максимальная нагрузка:  150 кг. <br> <b>Преимущества:</b>  Безопасность,  эффективность для тренировки мышц ног,  возможность регулировать нагрузку. <br> <b>Рекомендации:</b>  Используйте тренажер с осторожностью,  следите за правильной техникой выполнения упражнений. "
        },
        {
            "name": "Тренажер для пресса",
            "img": "img/equipment/force/Тренажер для пресса.jpg",
            "description": "Для эффективной тренировки мышц живота",
            "details": "Тренажеры для пресса помогают выполнять различные упражнения,  направленные на укрепление мышц живота. <br> <b>Технические параметры:</b>  Тип:  скамья,  Максимальная нагрузка:  100 кг. <br> <b>Преимущества:</b>  Доступность,  эффективность для тренировки мышц живота,  возможность регулировать нагрузку. <br> <b>Рекомендации:</b>  Следите за правильной техникой выполнения упражнений,  увеличивайте нагрузку постепенно. "
        },
        {
            "name": "Kettlebell",
            "img": "img/equipment/force/Kettlebell.jpg",
            "description": "Для функциональных тренировок,  улучшающих силу,  выносливость и координацию",
            "details": "Kettlebell - это утяжеленная гиря с ручкой,  которая используется для выполнения динамических упражнений,  развивающих силу,  выносливость и координацию. <br> <b>Технические параметры:</b>  Вес:  от 4 кг до 40 кг,  Размер:  от 12 см до 20 см. <br> <b>Преимущества:</b>  Универсальность,  эффективность для развития силы,  выносливости и координации,  возможность выполнять множество упражнений. <br> <b>Рекомендации:</b>  Следите за правильной техникой выполнения упражнений,  постепенно увеличивайте нагрузку. "
        },
        {
            "name": "Тренажер для подтягиваний",
            "img": "img/equipment/force/Тренажер для подтягиваний.jpg",
            "description": "Для тренировки мышц спины,  плеч и рук",
            "details": "Тренажер для подтягиваний - это простой и эффективный тренажер для тренировки мышц спины,  плеч и рук. <br> <b>Технические параметры:</b>  Материал:  металл,  Максимальная нагрузка:  150 кг. <br> <b>Преимущества:</b>  Доступность,  эффективность для тренировки мышц спины,  плеч и рук. <br> <b>Рекомендации:</b>  Следите за правильной техникой выполнения упражнений,  постепенно увеличивайте нагрузку. "
        }
    ],
    "functional": [
        {
            "name": "TRX-петли",
            "img": "img/equipment/func/TRX-петли.jpg",
            "description": "Для функциональных тренировок с использованием собственного веса",
            "details": "TRX-петли - универсальный тренажер для тренировки мышц кора, баланса и координации. <br> <b>Технические параметры:</b>  Максимальная нагрузка: 150 кг,  Регулируемая длина строп. <br> <b>Преимущества:</b>  Универсальность,  возможность выполнять множество упражнений,  эффективность для тренировки мышц кора, баланса и координации. <br> <b>Рекомендации:</b>  Следите за правильной техникой выполнения упражнений,  увеличивайте нагрузку постепенно. "
        },
        {
            "name": "Фитбол",
            "img": "img/equipment/func/Фитбол.jpg",
            "description": "Универсальный тренажер для тренировки мышц кора, улучшения баланса и координации",
            "details": "Фитболы подходят для самых разных тренировок, от пилатеса до силовых упражнений. <br> <b>Технические параметры:</b>  Диаметр: 65 см,  Максимальная нагрузка: 150 кг. <br> <b>Преимущества:</b>  Универсальность,  эффективность для тренировки мышц кора, баланса и координации,  возможность выполнять множество упражнений. <br> <b>Рекомендации:</b>  Следите за правильной техникой выполнения упражнений,  увеличивайте нагрузку постепенно. "
        },
        {
            "name": "Бодибар",
            "img": "img/equipment/func/Бодибар.jpg",
            "description": "Для силовых и функциональных тренировок с различными уровнями нагрузки",
            "details": "Бодибары - это утяжеленные палки, которые используются для повышения интенсивности тренировок. <br> <b>Технические параметры:</b>  Длина: 90-120 см,  Вес: 2-10 кг. <br> <b>Преимущества:</b>  Универсальность,  эффективность для силовых и функциональных тренировок,  возможность варьировать нагрузку. <br> <b>Рекомендации:</b>  Используйте бодибар с осторожностью,  следите за правильной техникой выполнения упражнений,  постепенно увеличивайте нагрузку. "
        },
        {
            "name": "Кольца для кроссфита",
            "img": "img/equipment/func/Кольца для кроссфита.jpg",
            "description": "Для тренировки силы, выносливости и координации",
            "details": "Кольца для кроссфита - это универсальный тренажер для выполнения разнообразных упражнений с собственным весом. <br> <b>Технические параметры:</b>  Материал: дерево/пластик,  Диаметр: 28 мм. <br> <b>Преимущества:</b>  Универсальность,  эффективность для тренировки силы, выносливости и координации,  возможность выполнять множество упражнений. <br> <b>Рекомендации:</b>  Следите за правильной техникой выполнения упражнений,  постепенно увеличивайте нагрузку. "
        },
        {
            "name": "Медицинский мяч",
            "img": "img/equipment/func/Медицинский мяч.jpg",
            "description": "Для функциональных тренировок, направленных на развитие силы, мощности и взрывной силы",
            "details": "Медицинские мячи используются для выполнения динамических упражнений, развивающих силу и координацию. <br> <b>Технические параметры:</b>  Вес: 3-10 кг,  Диаметр: 35 см. <br> <b>Преимущества:</b>  Эффективность для развития силы, мощности и взрывной силы,  возможность выполнять множество упражнений. <br> <b>Рекомендации:</b>  Используйте мяч с осторожностью,  следите за правильной техникой выполнения упражнений. "
        }
    ]
};


function displayTrainers(category) {
    let html = `
        <nav class="nav nav-pills nav-justified">
            <a class="nav-item nav-link ${category === 'cardio' ? 'active' : ''}" data-toggle="tab" href="#cardio" onclick="displayTrainers('cardio')">Кардио</a>
            <a class="nav-item nav-link ${category === 'strength' ? 'active' : ''}" data-toggle="tab" href="#strength" onclick="displayTrainers('strength')">Силовые</a>
            <a class="nav-item nav-link ${category === 'functional' ? 'active' : ''}" data-toggle="tab" href="#functional" onclick="displayTrainers('functional')">Функциональные</a>
        </nav>
        <div class="tab-content mt-4">
            <div class="tab-pane fade show active">
                <div class="row">
    `;
    data[category].forEach(item => {
        html += `
            <div class="col-md-4 mb-4">
                <div class="card">
                    <img src="${item.img}" class="card-img-top" alt="${item.name}">
                    <div class="card-body">
                        <h5 class="card-title">${item.name}</h5>
                        <p class="card-text">${item.description}</p>
                        <button class="btn btn-primary" onclick="showDetails('${category}', '${item.name}')">Подробнее</button>
                    </div>
                </div>
            </div>
        `;
    });
    html += `
                    </div>
                </div>
            </div>
        `;
    $('#content-container').html(html);
}

function showDetails(category, trainerName) {
    const trainer = data[category].find(item => item.name === trainerName);
    if (trainer) {
        const html = `
            <div class="container">
                <div class="row">
                    <div class="col-md-6">
                        <img src="${trainer.img}" class="img-fluid" alt="${trainer.name}">
                    </div>
                    <div class="col-md-6">
                        <h2>${trainer.name}</h2>
                        <p>${trainer.details}</p>
                        <button class="btn btn-secondary" onclick="displayTrainers('${category}')">Назад</button>
                    </div>
                </div>
            </div>
        `;
        $('#content-container').html(html);
    }
}

$(document).ready(function() {
    displayTrainers("cardio");
});
